tutors = [
    'Иван', 'Анастасия', 'Петр', 'Сергей',
    'Дмитрий', 'Борис', 'Елена'
]

klasses = [
    '9А', '7В', '9Б', '9В', '8Б', '10А', '10Б', '9А'
]

def gen_of_people():
    i = 0
    j = 0
    while i < len(klasses):
        if i >= len(tutors):
              yield (None, klasses[i])
              i += 1
              j += 1
              break
        else:
            yield (tutors[j], klasses[i])
            i += 1
            j += 1


for gen in gen_of_people():
    print(gen)
for gen in gen_of_people():
    print(gen) # Я пытался тут показать что генератор не будет работать повторно, но функции-генераторы помоему могут много раз работать, в отличии от однострочных, верно ведь?


print(type(gen_of_people())) # Тип генератор

# Генераторы полезны когда нужно оптимизировать используемое кол-во памяти, если нам не нужны именно индексируемые или у нас мало место - то генераторы могут подойти

